{
  "G:NNP|P:NN": "//genia, postmed, or mix\nglobal_correct_tagger=mix\nglobal_tagger_default=genia\n\n//word : genia or postmed or mix (notes)\nword_correct_tagger={\nFig.:genia(These were 4 instances of the name of a figure such as Fig. 4a, the number that follows also has the same classification as Fig. which shows that the taggers just differ on how to tag this)\nCA:genia(2 samples indicated california shorthand was not properly recognized as proper nound and other proper nouns were also being missed elsewhere in the sentence)\nUniversity:genia(4 samples were identifying, part of, university names)\nHealth:genia(2 samples were again names of things capitalized)\nFigure:genia(Similar to Fig.)\nC.:genia(2 samples showed first part of a bacteria name like C. Elegans)\nS.:genia(Similar to C.)\nFig:genia(Similar to Fig.)\nUK:mix->NNP(The two taggers are both right and wrong in different cases so we need to override) \nMonte:genia(except 1 case it was always right)\nCarlo:genia(except 1 case it was always right)\n}\n\n//general notes\nProper names exist such as the United States of America, and Wikipedia says that all of these words should be NNP \nWe are going to double back and look at the wall street journals opinion on these differences so we are consistent with that tagger in which we choose \nWe found that C. and S. are short forms for the names of biological things which are followed by a second name which is also confused in this same posdiff (Source: http://evolution.wormbase.org/index.php/LIST_OF_AVAILABLE_CAENORHABDITIS_SPECIES_and_the_state_of_their_genome_projects) here are some names for the S. (Source: http://www.bacterio.net/streptococcus.html)\nWe are thinking that Genia has a nice dictionary of proper nouns whereas postmed may be using contextual information to make this choice and is getting it wrong. \nThere are only 4 cases where there are POSDiff-C\n\nGenia seems to be right most of the time here, there was one edge case for UK which we wrote in a hard override for. ",
  "G:JJ|P:NN": "//genia, postmed, or mix\nglobal_correct_tagger=mix\nglobal_tagger_default=genia\n\n//word : genia or postmed or mix (notes)\nword_correct_tagger={\nTable=postmed (Table one, like in identifying an appendix, 3 samples all showed the same behaviour.)\nhuman=postmed (In 3 samples, it was calling a noun used as part of a NN NN compound a JJ, when in this case both should be nouns. We saw a NN JJ NN and a JJ NN compound where the JJ should have been NN NN NN) \nmean=postmed (Same as above, incorrect JJ tag in 3 samples) \npositive=mix:PRIOR_WORD_TAG@JJ|NN?postmed,genia (the cases in which Postmed are correct are tending to talk about electricity and charge and true / false positives, in 2 cases we had instances of true positive or false positive which could be caught with a special condition, there was a 3rd case that is much harder to identify due to the sent. structure [http://localhost/research/pos_word_instance.html?d=G:JJ|P:NN&w=positive&g=Qk1DX0Jpb2luZm9ybWF0aWNzL0JNQ19CaW9pbmZvcm1hdGljcy05LVN1cHBsXzItMjMyMzY2Ni5ueG1sLmdlbmlhLnRhZ2dlZHwxMDUvMjQ=&p=Qk1DX0Jpb2luZm9ybWF0aWNzL0JNQ19CaW9pbmZvcm1hdGljcy05LVN1cHBsXzItMjMyMzY2Ni5ueG1sLnBvc3RtZWQudGFnZ2VkfDEwNS8yNA==] . We assess that this procedure will be right for the genia cases, and capture many of the postmed is correct cases although miss some complicated one like the aforementioned one with the link as they are not proceeded by a JJ. We may want to review how this rule applies to a broader set later )\nnegative=mix:PRIOR_WORD_TAG@JJ|NN?postmed,genia (same justification as for positive)\nfirst=genia (all 6 samples were consistent and were sentences like over the first two years where it needed to be JJ)\nadult=genia (4 of 5 genia were right, the case where it was wrong discussed adult life) \nwild-type=genia (wild-type always need to be adjective because of the hyphen) \nmale=genia (same as adult, no samples examined) \nfemale=genia (same as adult, no samples examined) \npresent=mix:PRIOR_WORD@the&FOLLOWING_WORD_TAG@~NN&~NNS?postmed,genia (Genia is right in many cases here and we have an edge case recorded for when it is not correct, note any comparative or superlative adjective that follows this pattern will respect this rule)\npast=mix:PRIOR_WORD@the&FOLLOWING_WORD_TAG@~NN&~NNS?postmed,genia (similar to present, did not examine samples)\nfuture=mix:PRIOR_WORD@the&FOLLOWING_WORD_TAG@~NN&~NNS?postmed,genia (similar to present, did not examine samples)\nlatter=mix:PRIOR_WORD@the&FOLLOWING_WORD_TAG@~NN&~NNS?postmed,genia (similar to present, did not examine samples)\nformer=mix:PRIOR_WORD@the&FOLLOWING_WORD_TAG@~NN&~NNS?postmed,genia (similar to present, did not examine samples, no instances)\nmaximum=mix:PRIOR_WORD@the&FOLLOWING_WORD_TAG@~NN&~NNS?postmed,genia (similar to present, did not examine samples)\nminimum=mix:PRIOR_WORD@the&FOLLOWING_WORD_TAG@~NN&~NNS?postmed,genia (similar to present, did not examine samples)\nfold=mix:PRIOR_WORD_TAG@CD?genia,postmed (postmed usually as it should be NN but there was a case of folds being used as times where genia was right, 4 samples 3 were with postmed case. We are guessing that for most cases it is the property of folding something, so postmed is right with NN) \n\n*er&~*cancer=mix:PRIOR_WORD@the&FOLLOWING_WORD_TAG@~NN&~NNS?postmed,genia (similar to present, did not examine samples)\n*est=mix:PRIOR_WORD@the&FOLLOWING_WORD_TAG@~NN&~NNS?postmed,genia (similar to present, did not examine samples)\n\n}\n\n//general notes\nWe looked at around a quarter of the cumulative frequency \nWe think in the remainder we will find a ",
  "G:VB|P:VBP": "//genia, postmed, or mix\nglobal_correct_tagger=genia\nglobal_tagger_default=\n\n//word : genia or postmed or mix (notes)\nword_correct_tagger={\n\n}\n\n//general notes\nMost of the context windows are following MD tags given an assessment looking at the tag context (directly before and after) this POS Diff\nThis is in line with how the WSJ tags the word be (99% of the time is is VB)\nWith regards to have its more dependant on the context (WSJ tagging is split between more cases with relatively even frequency)  \nGiven the context for the word have we explored, Genia was still tagging correctly in this case (The context would be any auxiliary)\nIt looks like most of these are part of complex verb phrases which also supports how Genia is tagging this\n\n\nPostmed tags: \n                \"MD_\": 15,\n                \"MD_''\": 70,\n                \"MD_(\": 296,\n                \"MD_)\": 35,\n                \"MD_,\": 889,\n                \"MD_.\": 2,\n                \"MD_.\\n\": 913,\n                \"MD_:\": 100,\n                \"MD_CC\": 1641,\n                \"MD_CD\": 1432,\n                \"MD_DT\": 34544,\n                \"MD_EX\": 6,\n                \"MD_FW\": 70,\n                \"MD_IN\": 21510,\n                \"MD_JJ\": 27916,\n                \"MD_JJR\": 1434,\n                \"MD_JJS\": 59,\n                \"MD_MD\": 15,\n                \"MD_NN\": 10808,\n                \"MD_NNP\": 6,\n                \"MD_NNS\": 4155,\n                \"MD_PDT\": 272,\n                \"MD_POS\": 42,\n                \"MD_PRP\": 1568,\n                \"MD_PRP$\": 1353,\n                \"MD_RB\": 15454,\n                \"MD_RBR\": 29,\n                \"MD_RBS\": 121,\n                \"MD_RP\": 228,\n                \"MD_SYM\": 31,\n                \"MD_TO\": 10308,\n                \"MD_VB\": 423,\n                \"MD_VBD\": 490,\n                \"MD_VBG\": 1755,\n                \"MD_VBN\": 77417,\n                \"MD_VBP\": 470,\n                \"MD_VBZ\": 162,\n                \"MD_WDT\": 63,\n                \"MD_WP\": 47,\n                \"MD_WRB\": 616,\n                \"MD_``\": 151,\n                \"MD_or\": 12,\n\n\n",
  "G:VBN|P:JJ": "//genia, postmed, or mix\nglobal_correct_tagger=genia\nglobal_tagger_default=\n\n//word : genia or postmed or mix (notes)\nword_correct_tagger={\nincreased:genia (in all 6 samples cases for this transitive verb genia tagged VBN properly and postmed called it an adjective) \ngiven:genia (accross 3 samples we saw that it was either being used as an adjective or as part of a verb form)\nobserved:genia (same as above) \n}\n\n//general notes\nThese are all verbs, there is no way that they could be adjectives. Postmed is making errors in tagging these and it is consistently doing it wrong. \n",
  "G:VBG|P:JJ": "//genia, postmed, or mix\nglobal_correct_tagger=genia\nglobal_tagger_default=\n\n//word : genia or postmed or mix (notes)\nword_correct_tagger={\nfollowing: genia (These are verbs not adjectives, sampled 6 cases) \ncorresponding: genia (These are verbs not adjectives, sampled 4 cases) \ndeveloping: genia (Same as above, 4 sampled)\n}\n\n//general notes\nThere is some concentration with a light taper out. Looking at the size of the complementary POSDiff we note that it is very rare. \nRing which should be an adjective is not present, this confirms that most of these cases are really just verbs being confused by postmed.\n\n",
  "G:NN|P:JJ": "//genia, postmed, or mix\nglobal_correct_tagger=mix\nglobal_tagger_default=genia\n\n//word : genia or postmed or mix (notes)\nword_correct_tagger={\nbinding:mix->VBG (These were all binding sites, sampled 6) \ntraining:mix->VBG (6 sampled)\namino:postmed (always adjective)\n*ing=mix->VBG (based on a lot of ing words here, and binding and training example cases)  \nweb:genia(always referring to web products or things, 5 sampled) \nPM:genia (these refer to post mortum which is a noun)\npoly:genia (feels like poly is used in the sense of a noun, 4 sampled)\nset:genia (noun is typically right but there are cases, 1 of the sampled 6 that break this like a set methodology. We examined another 5 samples and they were all nouns so go with genia, that 1 case is a less frequent case based on this sample that we will just put up with. Note set is meant in the sense of fixed.) \ntransmembrane:postmed (6 samples it was all basic use, biomed dictionary say JJ)\n\n}\n\n//general notes\nMany of the most frequent cases are -ing words. \nRoughly 2 in 8 are ing across full set  \nThere are words like training that we looked up in the english dictionary, and the dictionary says that it is a noun, but if we follow a hard and fast rule that it is really a present participle of the verb then it should be a VBG.\nMercer to check WSJ data to see what they do in cases like the training case. \n",
  "G:NN|P:SYM": "//genia, postmed, or mix\nglobal_correct_tagger=postmed\nglobal_tagger_default=\n\n//word : genia or postmed or mix (notes)\nword_correct_tagger={\n\n}\n\n//general notes\n\n",
  "G:VBG|P:NN": "//genia, postmed, or mix\nglobal_correct_tagger=genia\nglobal_tagger_default=\n\n//word : genia or postmed or mix (notes)\nword_correct_tagger={\n\n}\n\n//general notes\nNearly all end in ing so these are verbs\n",
  "G:VBN|P:VBD": "//genia, postmed, or mix\nglobal_correct_tagger=genia\nglobal_tagger_default=genia\n\n//word : genia or postmed or mix (notes) NOTE: these can be ignored due to global \nword_correct_tagger={\ndescribed:postmed (5 sampled results, in many cases it was absolutely obvious it was a verb as it was the main verb of the sentence without any auxiliary before it as such not being a complex verb phrase, as previously described subordinate clause the described had to be the verb)\nused:genia (5 sampled, 4 were simple to pick as past participles but there were some very tough cases, we could take a deeper look at this in the future)\nbased:postmed (going with VBD because it is not part of a complex verb and it is not modifying a noun, look deeper if time allows)\ncompared:genia (they all compare nouns so VBN)\nreported:mix:PRIOR_WORD_TAG@RB?postmed,genia (The postmed cases were all as previously reported. there was also one outlier which was the main verb not captured in this rule)\n\n}\n\n//general notes\nThis POSDiff will need more work as we have only covered 21% of cases with this procedure. We hope that described and based are more outlying conditions so we will go with Genia for the remainder \nWe've referred to the stanford tree parser which reinformed our understanding and we are now changing to VBN ",
  "G:DT|P:PRP": "//genia, postmed, or mix\nglobal_correct_tagger=genia\nglobal_tagger_default=\n\n//word : genia or postmed or mix (notes)\nword_correct_tagger={\n\n}\n\n//general notes\nNone of these are personal pronouns \n",
  "G:NNS|P:VBZ": "//genia, postmed, or mix\nglobal_correct_tagger=\nglobal_tagger_default=\n\n//word : genia or postmed or mix (notes)\nword_correct_tagger={\nsets: genia (5 sampled and they all should have been NNS)\npairs: genia (5 sampled and they all should have been NNS)\nresults: genia (5 sampled were all NNS)\npoints: genia (3 sampled) \n}\n\n//general notes\nIt looks like Postmed makes a mistake thinking the word before is an NNS then thinks that this word is a verb ",
  "G:NNS|P:NN": "//genia, postmed, or mix\nglobal_correct_tagger=mix\nglobal_tagger_default=mix:LAST_LETTER@s?postmed,genia\n\n//word : genia or postmed or mix (notes)\nword_correct_tagger={\ns=postmed (5 sampled, just because the noun is s does not make it plural)\nbacteria=mix:FOLLOWING_WORD_TAG@NNP|NN?postmed,genia (we can detect when it should be part of a noun and as such singular with this case, 5 sampled)\nspecies=genia\nPBS=postmed(its not plural)\nbioinformatics=postmed(its not plural)\nteeth=genia (teeth is plural)\nDCs=genia (plural 3 sampled)\nGPs=genia (plural 2 sampled)\ndiabetes=postmed (end in s error, guess)\nstatistics=postmed (end in s error, guess)\nproteomics=postmed (end in s error, guess)\nsemen=postmed (end in s error, guess)\nelegans->NNP\n}\n\n//general notes\n\n",
  "G:RB|P:WRB": "//genia, postmed, or mix\nglobal_correct_tagger=genia\nglobal_tagger_default=\n\n//word : genia or postmed or mix (notes)\nword_correct_tagger={\n\n}\n\n//general notes\n\n"
}